<b>PART-I<b>

<b>Preprocessing of raw_wheat.csv to wheat.csv<b>

In [1]:
import pylab
import calendar
import numpy as np
import pandas as pd
import seaborn as sn
from scipy import stats
#import missingno as msno
from datetime import datetime
import matplotlib.pyplot as plt
import warnings
pd.options.mode.chained_assignment = None
warnings.filterwarnings("ignore", category=DeprecationWarning)
%matplotlib inline

/usr/local/lib/python3.6/dist-packages/statsmodels/tools/_testing.py:19: FutureWarning: pandas.util.testing is deprecated. Use the functions in the public API at pandas.testing instead.
  import pandas.util.testing as tm

In [2]:
from google.colab import drive
drive.mount('/content/gdrive')

Go to this URL in a browser: https://accounts.google.com/o/oauth2/auth?client_id=947318989803-6bn6qk8qdgf4n4g3pfee6491hc0brc4i.apps.googleusercontent.com&redirect_uri=urn%3aietf%3awg%3aoauth%3a2.0%3aoob&response_type=code&scope=email%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdocs.test%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive%20https%3a%2f%2fwww.googleapis.com%2fauth%2fdrive.photos.readonly%20https%3a%2f%2fwww.googleapis.com%2fauth%2fpeopleapi.readonly

Enter your authorization code:
··········
Mounted at /content/gdrive

In [3]:
daily_Data= pd.read_csv("/content/gdrive/My Drive/Sih_hamara/potato_pricing/daily_wholesale_price_Potato-upto_apr_2015.csv")

In [4]:
daily_Data.head(2)

       Date Centre_Name Commodity_Name  Price
0  01-01-09  CHANDIGARH         Potato    NaN
1  01-01-09       DELHI         Potato  212.0

In [5]:
daily_Data.shape

(73311, 4)

In [6]:
df=daily_Data.copy()

In [7]:
df.columns

Index(['Date', 'Centre_Name', 'Commodity_Name', 'Price'], dtype='object')

In [ ]:
df=df.rename(index=str, columns={"Sl no.": "Sl_no", "Min Price (Rs./Quintal)": "Min_Price","Price Date":"Price_Date","Modal Price (Rs./Quintal)":"Modal_Price"})

In [8]:
df.head()

       Date Centre_Name Commodity_Name  Price
0  01-01-09  CHANDIGARH         Potato    NaN
1  01-01-09       DELHI         Potato  212.0
2  01-01-09      SHIMLA         Potato    NaN
3  01-01-09    SRINAGAR         Potato    NaN
4  01-01-09       JAMMU         Potato    NaN

In [9]:
df.columns

Index(['Date', 'Centre_Name', 'Commodity_Name', 'Price'], dtype='object')

In [10]:
df.Date = pd.to_datetime(df.Date, errors='coerce')

In [11]:
df.head()

        Date Centre_Name Commodity_Name  Price
0 2009-01-01  CHANDIGARH         Potato    NaN
1 2009-01-01       DELHI         Potato  212.0
2 2009-01-01      SHIMLA         Potato    NaN
3 2009-01-01    SRINAGAR         Potato    NaN
4 2009-01-01       JAMMU         Potato    NaN

In [12]:
df=df.sort_values(by='Date')

In [13]:
df.drop_duplicates('Date', inplace = True)

In [14]:
df.head(20)

           Date   Centre_Name Commodity_Name   Price
0    2009-01-01    CHANDIGARH         Potato     NaN
1636 2009-01-04  BHUBANESHWAR         Potato     NaN
2125 2009-01-05      SHILLONG         Potato     NaN
2661 2009-01-06        RANCHI         Potato     NaN
3250 2009-01-07     AHMEDABAD         Potato  1125.0
4420 2009-01-09      SHILLONG         Potato     NaN
4957 2009-01-10  BHUBANESHWAR         Potato     NaN
6059 2009-01-12        BHOPAL         Potato     NaN
215  2009-01-13     HYDERABAD         Potato     NaN
216  2009-01-14    CHANDIGARH         Potato     NaN
244  2009-01-15         DELHI         Potato   225.0
271  2009-01-16         DELHI         Potato   225.0
311  2009-01-19         PATNA         Potato     NaN
337  2009-01-20        JAIPUR         Potato     NaN
352  2009-01-21         DELHI         Potato   250.0
379  2009-01-22         DELHI         Potato   250.0
419  2009-01-23         PATNA         Potato     NaN
444  2009-01-27        MUMBAI         Potato     NaN
459  2009-01-28    CHANDIGARH         Potato     NaN
486  2009-01-29    CHANDIGARH         Potato     NaN

## saving it to potato.csv ##

In [15]:
df.to_csv("/content/gdrive/My Drive/Sih_hamara/potato_pricing/potato.csv", sep=',')